package 智力题;

/**
 * Created by 杨杰 on 2018/5/15 10:44.
 * 前提：
 1 有五栋五种颜色的房子
 2 每一位房子的主人国籍都不同
 3 这五个人每人只喝一种饮料，只抽一种牌子的香烟，只养一种宠物
 4 没有人有相同的宠物，抽相同牌子的香烟，喝相同的饮料
 提示：
 １　 英国人住在红房子里
 ２　 瑞典人养了一条狗
 ３　 丹麦人喝茶
 ４　 绿房子在白房子左边
 ５　 绿房子主人喝咖啡
 ６　 抽ＰＡＬＬ　ＭＡＬＬ烟的人养了一只鸟
 ７　 黄房子主人抽ＤＵＮＨＩＬＬ烟
 ８　 住在中间那间房子的人喝牛奶
 ９　 挪威人住第一间房子
 １０　抽混合烟的人住在养猫人的旁边
 １１　养马人住在抽ＤＵＮＨＩＬＬ烟的人旁边
 １２　抽ＢＬＵＥ　ＭＡＳＴＥＲ烟的人喝啤酒
 １３　德国人抽ＰＲＩＮＣＥ烟
 １４　挪威人住在蓝房子旁边
 １５　抽混合烟的人的邻居喝矿泉水
 问题是：谁养鱼？？？
 答案：德国人
 */
public class 谁养鱼 {
    public static void main(String[] args) {
        String[] colors = {"绿", "蓝", "红", "黄", "白"};
        String[] pets = {"鸟", "鱼", "狗", "马", "猫"};
        String[] drinks = {"水", "咖啡", "茶", "啤酒", "牛奶"};
        String[] nations = {"英国", "挪威", "瑞典", "德国", "丹麦"};
        String[] smokes = {"PRINCE", "BLUE MASTER", "DUNHILL", "PALLMALL", "混合烟"};

        // 需要用到全排列

    }
}
